In [1]:
import numpy as np
import pandas as pd

path = 'c:/reposit/data/'

In [2]:
df = pd.read_csv(path + 'vizable/슈퍼스토어 - 샘플.xls - 주문.csv')
df.shape

(10933, 20)

In [3]:
df.isnull().sum()

행 ID     0
주문 ID    0
주문 날짜    0
배송 날짜    0
배송 형태    0
고객 ID    0
고객 이름    0
세그먼트     0
도시       0
시/도      0
국가/지역    0
지역       0
제품 ID    0
범주       0
하위 범주    0
제품 이름    0
매출       0
수량       0
할인율      0
수익       0
dtype: int64

In [21]:
df.head(3)

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education

In [8]:
df = pd.read_csv(path + 'kaggle/german_credit/german_credit_data.csv', index_col=0)
df.shape

(1000, 9)

In [9]:
df.isnull().sum()

Age                   0
Sex                   0
Job                   0
Housing               0
Saving accounts     183
Checking account    394
Credit amount         0
Duration              0
Purpose               0
dtype: int64

In [10]:
df.head(3)

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,67,male,2,own,NaN,little,1169,6,radio/TV
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education

In [20]:
for i in range(50):
    df.loc[1000+i] = [np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan]

df.tail(3)

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
1047,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1048,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1049,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
df.isnull().sum()

Age                  50
Sex                  50
Job                  50
Housing              50
Saving accounts     233
Checking account    444
Credit amount        50
Duration             50
Purpose              50
dtype: int64